const facultyData = [
    {
        name: "คณะครุศาสตร์และการพัฒนามนุษย์",
        branches: [
            "การประถมศึกษา", "การศึกษาปฐมวัย", "คณิตศาสตร์", "วิทยาศาสตร์ทั่วไป",
            "คอมพิวเตอร์ศึกษา", "ภาษาอังกฤษ", "ภาษาไทย", "สังคมศึกษา",
            "ดนตรีศึกษา", "พลศึกษา", "การสอนภาษาจีน", "นาฏศิลป์ศึกษา",
        ],
    },
    {
        name: "คณะศิลปศาสตร์และวิทยาศาสตร์",
        branches: [
            "วิทยาการคอมพิวเตอร์", "เทคโนโลยีคอมพิวเตอร์และดิจิทัล", "เทคโนโลยีและนวัตกรรมอาหาร",
            "วิทยาศาสตร์สิ่งแวดล้อม", "สาธารณสุขชุมชน", "วิทยาศาสตร์การกีฬา",
            "เทคโนโลยีการเกษตร", "อาชีวอนามัยและความปลอดภัย", "วิศวกรรมซอฟต์แวร์",
            "วิศวกรรมโลจิสติกส์", "วิศวกรรมการจัดการอุตสาหกรรมและสิ่งแวดล้อม",
            "การออกแบบผลิตภัณฑ์และนวัตกรรมวัสดุ", "เทคโนโลยีโยธาและสถาปัตยกรรม",
        ],
    },
    {
        name: "คณะมนุษยศาสตร์และสังคมศาสตร์",
        branches: [
            "การพัฒนาชุมชน", "ภาษาจีน", "ภาษาญี่ปุ่น", "ภาษาอังกฤษธุรกิจ",
            "บรรณารักษศาสตร์และสารสนเทศศาสตร์", "ศิลปะและการออกแบบ",
            "ภาษาไทยเพื่อการสื่อสาร", "ประวัติศาสตร์", "นิเทศศาสตร์",
        ],
    },
    {
        name: "วิทยาลัยกฎหมายและการปกครอง",
        branches: ["นิติศาสตร์", "รัฐประศาสนศาสตร์", "รัฐศาสตร์"],
    },
    {
        name: "คณะบริหารธุรกิจและการบัญชี",
        branches: [
            "การจัดการ", "การตลาด", "คอมพิวเตอร์ธุรกิจ", "บริหารธุรกิจระหว่างประเทศ",
            "เศรษฐศาสตร์การเงินและการคลัง", "การจัดการการท่องเที่ยวและการโรงแรม", "การบัญชี",
        ],
    },
    {
        name: "คณะพยาบาลศาสตร์",
        branches: ["พยาบาลศาสตร์"],
    },
];

const officeDepts = [
    "ฝ่ายทะเบียน",
    "ฝ่ายวิทยบริการและเทคโนโลยี",
    "ฝ่ายศูนย์ภาษา",
    "ฝ่ายกิจกรรม",
];

module.exports = { facultyData, officeDepts };
