export const officeDepts = [
    "ฝ่ายทะเบียน",
    "ฝ่ายวิทยบริการและเทคโนโลยี",
    "ฝ่ายศูนย์ภาษา",
    "ฝ่ายกิจกรรม"
];

export const facultyBranches = {
    'คณะครุศาสตร์และการพัฒนามนุษย์': [
        "การประถมศึกษา",
        "การศึกษาปฐมวัย",
        "คณิตศาสตร์",
        "วิทยาศาสตร์ทั่วไป",
        "คอมพิวเตอร์ศึกษา",
        "ภาษาอังกฤษ",
        "ภาษาไทย",
        "สังคมศึกษา",
        "ดนตรีศึกษา",
        "พลศึกษา",
        "การสอนภาษาจีน",
        "นาฏศิลป์ศึกษา"
    ],
    'คณะศิลปศาสตร์และวิทยาศาสตร์': [
        "วิทยาการคอมพิวเตอร์",
        "เทคโนโลยีคอมพิวเตอร์และดิจิทัล",
        "เทคโนโลยีและนวัตกรรมอาหาร",
        "วิทยาศาสตร์สิ่งแวดล้อม",
        "สาธารณสุขชุมชน",
        "วิทยาศาสตร์การกีฬา",
        "เทคโนโลยีการเกษตร",
        "อาชีวอนามัยและความปลอดภัย",
        "วิศวกรรมซอฟต์แวร์",
        "วิศวกรรมโลจิสติกส์",
        "วิศวกรรมการจัดการอุตสาหกรรมและสิ่งแวดล้อม",
        "การออกแบบผลิตภัณฑ์และนวัตกรรมวัสดุ",
        "เทคโนโลยีโยธาและสถาปัตยกรรม"
    ],
    'คณะมนุษยศาสตร์และสังคมศาสตร์': [
        "การพัฒนาชุมชน",
        "ภาษาจีน",
        "ภาษาญี่ปุ่น",
        "ภาษาอังกฤษธุรกิจ",
        "บรรณารักษศาสตร์และสารสนเทศศาสตร์",
        "ศิลปะและการออกแบบ",
        "ภาษาไทยเพื่อการสื่อสาร",
        "ประวัติศาสตร์",
        "นิเทศศาสตร์"
    ],
    'วิทยาลัยกฎหมายและการปกครอง': [
        "นิติศาสตร์",
        "รัฐประศาสนศาสตร์",
        "รัฐศาสตร์"
    ],
    'คณะบริหารธุรกิจและการบัญชี': [
        "การจัดการ",
        "การตลาด",
        "คอมพิวเตอร์ธุรกิจ",
        "บริหารธุรกิจระหว่างประเทศ",
        "เศรษฐศาสตร์การเงินและการคลัง",
        "การจัดการการท่องเที่ยวและการโรงแรม",
        "การบัญชี"
    ],
    'คณะพยาบาลศาสตร์': [
        "พยาบาลศาสตร์"
    ]
};

export const facultyList = Object.keys(facultyBranches);
